Repository: FedUni/SoniFight
Catalog: SoniFight/Properties/Resources.*.resx
Languages: fr

# statusStoppedString
source: Status: Stopped
fr: Statut: Arrêté

# configDirCreationFailedString
source: Error: Configs directory creation failed - please manually create a directory called \"Configs\" in the same folder as the SoniFight executable.
fr: Erreur: Échec de la création du répertoire de configuration - créez manuellement un répertoire appelé "Configs" dans le même dossier que l'exécutable SoniFight.

# missingConfigDirString
source: Error: Configs directory does not exist in same folder as SoniFight executable - click OK to create folder.
fr: Erreur: le répertoire Configs n'existe pas dans le même dossier que l'exécutable SoniFight - cliquez sur OK pour créer un dossier.

# noConfigsFoundString
source: No configs found in Configs directory!
fr: Aucune config trouvée dans le répertoire Configs!

# statusRunningString
source: Status: Running. Config:
fr: Statut: en cours d'exécution. Config:

# sonificationStoppedString
source: Sonification stopped.
fr: La sonification s'est arrêtée.

# gameConfigMainUILabelString
source: GameConfig General Settings
fr: GameConfig réglages généraux

# pollSleepLabelString
source: Poll Sleep (Milliseconds)
fr: Poll Sleep (Millisecondes)

# processNameLabelString
source: Process Name
fr: Nom du processus

# clockMaxWarningString
source: Warning: Clock max MS must be an integer between 30 and 100.
fr: Attention: Clock max MS doit être un nombre entier compris entre 30 et 100.

# clockTickLabelString
source: Clock Tick (Milliseconds)
fr: Horloge Tick (Millisecondes)

# clockTickWarningString
source: Warning: Clock tick must be a positive integer value specified in milliseconds.
fr: Attention: La coche d'horloge doit être une valeur entière positive spécifiée en millisecondes.

# pollSleepWarningString
source: Warning: Poll sleep must be a positive integer value specified in milliseconds.
fr: Avertissement: La durée du sondage doit être une valeur entière positive spécifiée en millisecondes.

# descriptionLabelString
source: Description
fr: La description

# deserialiseFailString1
source: Error: Deserialising gameconfig from
fr: Erreur: Désérialisation de gameconfig de

# deserialiseFailString2
source: has failed. Aborting.
fr: a échoué. Abandonner.

# watchDescriptionString1
source: A watch is a memory location expressed as a pointer chain leading to the address of a value of interest, and the type of data to read from that memory address.
fr: Une montre est un emplacement de mémoire exprimé sous la forme d'une chaîne de pointeurs conduisant à l'adresse d'une valeur d'intérêt, et le type de données à lire à partir de cette adresse de mémoire.

# watchDescriptionString2
source: Each watch must have a unique watch ID specified as an integer greater than or equal to zero, and may optionally have a name and description.
fr: Chaque montre doit avoir un identifiant de montre unique spécifié comme un nombre entier supérieur ou égal à zéro, et peut éventuellement avoir un nom et une description.

# watchDescriptionString3
source: Only watches that are marked as active will be used - this allows you to disable a watch while still keeping the data around in your GameConfig for later use, if you wish.
fr: Seules les montres marquées comme actives seront utilisées - cela vous permet de désactiver une montre tout en conservant les données dans votre GameConfig pour une utilisation ultérieure, si vous le souhaitez.

# watchDescriptionString4
source: Please consult the user documentation for further details on identifying pointer trails for use in watches.
fr: Veuillez consulter la documentation de l'utilisateur pour plus de détails sur l'identification des chaînes de pointeurs à utiliser dans les montres.

# watchSettingsLabelString
source: Watch Settings
fr: Watch Paramètres

# illegalPointerString1
source: Illegal Pointer Value
fr: Valeur du pointeur illégal

# illegalPointerString2
source: in watch with id
fr: en watch avec id

# illegalPointerString3
source: cannot be cast to int. Do not prefix pointer hops with 0x or such.
fr: ne peut pas être converti en int. Ne préfixez pas les sauts de pointeurs avec 0x ou tel.

# pointerListLabelString
source: Pointer Chain (comma-separated hex, no prefixes)
fr: Chaîne de pointeur (en hex avec des virgules)

# watchIdLabelString
source: Watch ID (unique int zero or greater)
fr: Watch ID (unique int zéro ou supérieur)

# watchIdWarningString
source: Warning: Watch ID must be an integer value.
fr: Attention: L'identifiant de la montre doit être une valeur entière.

# watchNameLabelString
source: Watch Name
fr: Watch Nom

# activeLabelString
source: Active
fr: Actif

# noneString
source: None
fr: Aucun

# triggersUsingThisWatchLabelString
source: Triggers Using This Watch
fr: Triggers Utilisant Cette Watch

# valueTypeLabelString
source: Value Type
fr: Type de Valeur

# deleteWatchButtonString
source: Delete Watch
fr: Effacer Watch

# triggerDescriptionLabelString
source: Trigger Description
fr: Description du Trigger

# triggerDescriptionString1
source: A trigger is a condition which can activate a sonification event when that trigger condition is met.
fr: Un trigger est une condition qui peut activer un événement de sonification lorsque cette condition de déclenchement est remplie

# triggerDescriptionString2
source: Triggers use watches, as identified by their numeric ID values, to read data and compare that data to certain conditions.
fr: Les triggers utilisent des watches, identifiées par leurs valeurs d'ID numériques, pour lire les données et les comparer à certaines conditions.

# triggerDescriptionString3
source: Each trigger must have a unique trigger ID specified as an integer greater than or equal to zero, and a condition to match against.
fr: Chaque trigger doit avoir un ID de déclencheur unique spécifié comme un nombre entier supérieur ou égal à zéro et une condition de correspondance.

# triggerDescriptionString4
source: Please consult the user documentation to learn more about how to set and use triggers.
fr: Veuillez consulter la documentation utilisateur pour en savoir plus sur la configuration et l'utilisation triggers.

# triggerSettingsLabelString
source: Trigger Settings
fr: Paramètres de Trigger

# triggerIdLabelString
source: Trigger ID (unique int zero or greater)
fr: Trigger ID (unique int zéro ou supérieur)

# triggerIdWarningString
source: Warning: Trigger ID must be an integer value.
fr: Attention: L'ID de déclencheur doit être une valeur entière.

# triggerNameLabelString
source: Trigger Name
fr: Nom du Trigger

# triggerTypeLabelString
source: Trigger Type
fr: Type de Trigger

# continuousTriggerIdLabelString
source: Continuous Trigger ID
fr: ID de Trigger Continu

# dependentTriggerIdLabelString
source: Dependent Trigger ID
fr: ID de Trigger Dépendant / Liste

# badTreeNodeTagWarningString
source: Warning: Got node with unrecognised Tag of:
fr: Attention: noeud obtenu avec le tag non reconnu de:

# comparisonTypeLabelString
source: Comparison Type
fr: Type de Comparaison

# sampleFilenameLabelString
source: Sample Filename (without path)
fr: Nom de Fichier Audio (sans chemin)

# screenReaderTextLabelString
source: Screen Reader Text
fr: Texte du Lecteur D'écran

# secondaryIdLabelContinuousTriggerIdString
source: Continuous Trigger ID
fr: ID de Trigger Continu

# secondaryIdLabelDependentIdString
source: Dependent Trigger ID
fr: ID Trigger Dépendant

# secondaryIdWarningString
source: Warning: Secondary ID must be an integer value.
fr: Avertissement: L'ID secondaire pour ce type de trigger doit être une valeur entière unique.

# selectSampleButtonString
source: Select Sample File
fr: Sélectionnez un fichier audio

# triggerValueMaxRangeLabelString
source: Trigger Value / Max Range
fr: Valeur de Trigger / Plage Maximale

# useTolkLabelString
source: Use Tolk
fr: Utilisation Tolk

# watch1LabelString
source: Watch 1 ID
fr: Watch ID / Liste

# addTriggerLabelString
source: Add Trigger
fr: Ajouter Trigger

# addWatchLabelString
source: Add Watch
fr: Ajouter Watch

# allowanceTypeLabelString
source: Allowance Type
fr: Type d'allocation

# changeMeString
source: CHANGE ME
fr: CHANGE MOI

# deleteTriggerButtonString
source: Delete Trigger
fr: Effacer Trigger

# isClockLabelString
source: Is Clock?
fr: Est-ce que Clock?

# newWatchString
source: -NEW_WATCH
fr: -NOUVEAU_WATCH

# sampleSpeedLabelString
source: Sample Speed (Range: 0.1 to 4.0)
fr: Vitesse de l'échantillon (plage: 0.1 à 4.0)

# sampleSpeedWarningString1
source: Warning: Sample speed must be a value between
fr: Attention: la vitesse de l'échantillon doit être une valeur entre

# sampleSpeedWarningString2
source: and
fr: et

# sampleVolumeLabelString
source: Sample Volume (Range: 0.0 to 1.0)
fr: Volume d'échantillon (gamme: 0.0 à 1.0)

# sampleVolumeWarningString
source: Warning: Sample volume must be a value between 0.0 and 1.0.
fr: Attention: le volume de l'échantillon doit être compris entre 0.0 et 1.0.

# cloneWatchLabelString
source: Clone Watch
fr: Cloner Watch

# cloneWatchWarningString
source: You must select a watch before opting to clone that watch.
fr: Vous devez sélectionner une montre avant d'opter pour cloner cette montre.

# newTriggerString
source: -NEW_TRIGGER
fr: -NOUVEAU_TRIGGER

# triggerCloneWarningString
source: You must select a trigger before opting to clone that trigger.
fr: Vous devez sélectionner un trigger avant d'opter pour cloner ce trigger.

# configDirCannotBeBlankString
source: Validation Error: GameConfig directory cannot be blank.
fr: Erreur de validation: Le répertoire GameConfig ne peut pas être vide.

# foundProcessBaseAddressString
source: Found process base address at hex address:
fr: Adresse de base de processus trouvée à l'adresse hexadécimale:

# processNotFoundWarningString1
source: Error: No process called
fr: Erreur: Aucun processus appelé

# processNotFoundWarningString2
source: found. Activation failed.
fr: a trouvé. Activation echouée.

# dynamicTypeComparisonExceptionString
source: Dynamic type comparison exception. Exact error is:
fr: Exception de comparaison de type dynamique. L'erreur exacte est:

# speedString
source: , Speed:
fr: , La vitesse:

# suppressedGameStateChangeString
source: Suppressed moving to InGame state because clock is 0 or
fr: Désactivé passant à l'état InGame car l'horloge est 0 ou

# tolkActiveString
source: Tolk: The active screen reader driver is:
fr: Tolk: Le pilote du lecteur d'écran actif est:

# tolkBrailleSupportedString
source: Tolk: This screen reader driver supports braille.
fr: Tolk: Ce pilote de lecteur d'écran prend en charge le braille.

# tolkNoScreenReaderFoundString
source: Tolk: None of the supported screen readers are running.
fr: Tolk: Aucun des lecteurs d'écran pris en charge ne fonctionne.

# tolkSpeechSupportedString
source: Tolk: This screen reader driver supports speech.
fr: Tolk: Ce pilote de lecteur d'écran prend en charge la parole.

# unrecognisedValueTypeWarningString
source: Unrecognised ValueType in getDynamicValueFromType method:
fr: ValueType non reconnu dans la méthode getDynamicValueFromType:

# deserialiseFailedString
source: Could not deserialize config from XML file:
fr: Impossible de désérialiser la configuration à partir du fichier XML:

# fileSavedSuccessfullyString
source: GameConfig saved successfully:
fr: GameConfig enregistré avec succès:

# fileSaveFailedString
source: Could not serialize GameConfig to XML:
fr: Impossible de sérialiser GameConfig en XML:

# keyNotFoundString
source: WARNING - Sample key not found in dictionary:
fr: Attention: Exemple de clé introuvable dans le dictionnaire:

# sampleNotFoundString
source: WARNING - Sample not found:
fr: Attention: échantillon non trouvé:

# isAnythingPlayingExceptionString
source: Exception during IsAnythingPlaying check:
fr: Exception lors de la vérification de IsAnythingPlaying:

# normalSampleNullSoundWarningString
source: Playing normal sample gave us a null sound for:
fr: Jouer un échantillon normal nous a donné un son nul pour:

# playingQueuedTriggerString
source: Playing Queued Trigger
fr: Jouer trigger en file d'attente

# playingTriggerString
source: Playing Trigger
fr: En jouan Trigger

# queuingTriggerString
source: Queuing Trigger
fr: Faire la Queue Trigger

# loadingContinuousSampleString
source: Loading continuous sample:
fr: Chargement de l'échantillon continu:

# loadingMenuSampleString
source: Loading menu sample:
fr: Chargement du sample de menu:

# loadingNormalSampleString
source: Loading normal sample:
fr: Chargement de l'échantillon normal:

# loadModifierSampleWarningString
source: WARNING: Aborting attempt to load sample for modifier trigger, and modifier triggers don't use samples.
fr: Avertissement: La tentative d'abandon de l'échantillon pour déclencher un modificateur et les déclencheurs de modification n'utilisent pas d'échantillons.

# nullSoundInQueuedSampleWarningString
source: Playing queued normal sample gave us a null sound for:
fr: Jouer un échantillon normal mis en file d'attente nous a donné un son nul pour:

# skippingInactiveTriggerSampleString
source: Skipping sample load for inactive trigger:
fr: Ignorer la charge de l'échantillon pour le trigger inactif:

# skippingTolkSampleLoadString
source: Skipping sample load for tolk trigger:
fr: Interruption de la charge de l'échantillon pour le trigger tolk:

# triggerSampleStoppedString
source: Trigger sample stopped:
fr: L'échantillon de trigger s'est arrêté:

source: Saying tolk string:
fr: Dire tolk string:

# watchValueParseFailString
source: WARNING: Could not get watch ID from parsing the following to int:
fr: AVERTISSEMENT: Impossible d'obtenir l'ID de la montre en analysant le suivant dans int:

# screenReaderNotActiveWarningString
source: WARNING: Tolk output requested but no active screen reader for trigger with ID:
fr: Attention: sortie Tolk demandée mais pas de lecteur d'écran actif pour trigger avec ID:

# attemptingToConnectToProcessString
source: Attempting to connect to process:
fr: Tentative de connexion au processus:

# continuousTriggerMasterVolumeString
source: Continuous Trigger Master Volume
fr: Volume maître de trigger continu

# continuousTriggerMasterVolumeWarningString
source: WARNING: Continuous trigger master volume must be a value between 0.0 and 1.0
fr: Attention: le volume principal du trigger doit être compris entre 0.0 et 1.0

# normalTriggerMasterVolumeWarningString
source: WARNING: Normal trigger master volume must be a value between 0.0 and 1.0
fr: Avertissement: le volume maître du déclencheur normal doit être compris entre 0.0 et 1.0

# noString
source: No
fr: Non

# yesString
source: Yes
fr: Oui

# usesTolkString
source: Uses Tolk
fr: Utilise Tolk

# formatExceptionString
source: WARNING: Pointer chain format exception.
fr: Avertissement: exception de format de chaîne de pointeur.
