Repository: FedUni/SoniFight
Catalog: SoniFight/Form1.*.resx
Languages: fr

# quitButton.Text
source: Quit
fr: Sortie

# createConfigButton.Text
source: Create New Config
fr: Créer une nouvelle configuration

# stopConfigButton.Text
source: Stop Running Config
fr: Arrêter d'exécuter la configuration

# runConfigButton.Text
source: Run Selected Config
fr: Exécuter la configuration sélectionnée

# refreshButton.Text
source: Refresh
fr: Rafraîchir

# editTabPage.Text
source: Edit Config
fr: Modifier la configuration

# saveConfigButton.Text
source: Save Game Configuration
fr: Sauvegarder la configuration du jeu

# addTriggerButton.Text
source: Add Trigger
fr: Ajouter un déclencheur

# addWatchButton.Text
source: Add Watch
fr: Ajouter une montre

# $this.Text
source: SoniFight Status: Stopped
fr: SoniFight v1.0 - Statut arrêté
